Revit 2027 API
RebarHostData.GetCommonCoverType Method
 If all exposed faces of the host have the same associated CoverType, return that CoverType; otherwise, return null.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarCoverType GetCommonCoverType()
Public Function GetCommonCoverType As RebarCoverType
public:
RebarCoverType^ GetCommonCoverType()
member GetCommonCoverType : unit -> RebarCoverType
Return Value
RebarCoverType
 The common CoverType for all exposed faces, or null if there are multiple CoverTypes.
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace